data.service/app/controllers/alfa/tables_controller.rb

SELECT `alfa_tables`.* FROM `alfa_tables`
---
  def index
    # Preparando cabeçalho de resposta
  	response = {}
    response["kind"] = "data#tables"
    response["nextPageToken"] = params[:token] #TODO: Precisa?

    # Obtendo as tabelas cadastradas
  	tables = Alfa::Table.all